package HomeWorks.homeWorks22.TaskB;

public class TaskB {
    /**
     * 1. Что такое инкапсуляция, приведите инструменты для ее реализации?
     * Инкапсуляцие это метод котоырй скрывает внутрение данные что бы их защитить от внешнего воздействия
     * для того чтобы какя нибудь информация вошла в нашем случае в класс то данная инфа должна пройти через буфер
     * для этого мы используем методы геттер(получения данных) и сеттер(установки даных и параметров)
     *
     * 2. Что такое наследование, приведите 2 примера наследования?
     * Наследование это перенос функций или переменых для будущих поколений проще говоря чтобы не парится и не писать новые
     * переменые допустим в классах которые могут такие же переменные или функции наследовать с наследуемого класса.
     * Так же наследователь не видит наследника на оборот может быть иначе.
     *
     * 3. Что такое static?
     * Static это параметр(переменная) которая статична и является константой для всех обьектов вызваных с данного класса
     *
     * 4. Для чего мы используем static?
     * Static мы используем для того чтобы обобщить какю либо информацию или переменую для всех оьектов данного класса
     *
     * 5. Можем ли мы унаследовать статичный метод?
     * Честно пока еще не читал не разбирался ибо не было времени но помойму статик наследуется так как наследование дает
     * допуск ко всем параметрам класса. Просьба сообщить где я не прав в обратной связи если можно
     *
     * 6. Как получить значение статичной переменной?
     * Для того что бы получить значение из статичной переменной мы олжны вызвать метод который возврощает данную
     * переменую путем вызова класса и через точку вызовом возрощаемого метода.
     * К примеру у меня есть клас человек в котором создаются обьекты человек с параметрами (Имя, Фамилия, Возраст)
     * и что бы вызвать статичную переменную нам нужно вызвать класс человек и через точку возврощаемый static метод
     *
     * 7. Как запретить изменение, но разрешить считывание статичной переменной?
     * Сделать статичную переменную приватной и не создовать для тее сетера саму переменную изменять в статик методе
     * после чего возврощать ее через метод.
     */
}
