package HomeWorks.homeWorks20;
public class Readme20 {
    /**
     *  Задачу А я не совсем понял наверное это из за того что я уже по такой схеме делаю все свои проэкты.
     *
     *  Теперь что касательно вопросов по задаче "Б" и как я их понял:
     *
     *  1) Что такое маодификаторы досступа и зачем они нужны?
     *  Модификаторы доступа нужны для того что бы ограничить доступ к классам а так же их работу в других классах что бы
     *  они не мешались и не путотся.
     *
     *  2) Какие бывают моджификаторы доступа?
     *  Модификаторы доступа бывают 4 типа
     *  Public - публичный клас который раскрыт и принимает в себя все значения которые могут вкладыватся из дургих классво
     *  проще гворя это открытый модификатор который окрыт к не запрещает изменения внуттри себя из вне
     *
     *  Private - это закрытй модификатор который не дает вносить в себя изменения из других классов
     *  если обозначить данным модификтором какй либо клас то он не будет работать. Так как данные классы являются
     *  вложенными класами в других класса и рабтают только внутри класса котоырй его вызывает.
     *  Если же вкладывать данный модификатор в поля то он делает переменые (характеристики) закрытыми от внешнего вмешательства.
     *
     *  Default - это модификатор доступа который работает только внутри пакета и за пределы пакета не дает выходить классу
     *  то есть класс под данным модификатором нельзя вызвать за пределами папка (пакета) в которой он создан.
     *
     *  Protected - это модификатор который вызывает внутри пакета в котором он создан и не выходит на за пределы пакета
     *  но данный клас позволяет наследовать свои характеристики и если какой либо клас наследует класс под данным
     *  модификатором то только тогдаданный класс можно вызвать за пределами пакета.
     *
     *  3) Что такое package, для чего они нужны?
     *
     *  Пакед или папка которую можно создовать внутри проэкта для того чтобы разделять классы ну или структурировать
     *  саму программу что позволяет не путотся в проэкте ели проэкт большой ну или если ты перфекционист который любит
     *  порядок и чтобы ввсе красиво выглядело. Проще говоря это как файловая папка в операционной системе
     *  блогодоря которым мы и сартируем ИГРЫ, МУЗЫКУ, ВИДЕО или еще какие либо личные даные что бы не было много мусора
     *  или чтобы не путотся в своих же собственных файлах.
     *
     *  4) В чем отличие между default и public?
     *
     *   Различия между ними что один открыт а второй может быть открытым только при наследовании.
     *   Ну или другими словами default можно вызвать только внутри папки в которой он создан а для того что бы
     *   вызвать его за пределами пакета(папки) его создания только если данный класс наследуется.
     *
     *   5) Зачем делать сеттер private а геттер public, что это нам даст?
     *
     *   сеттеры и геттеры нужны для того чтобы основные параметры класса не менялись из внешней среды и созовало путаницы
     *   если параметры класа мы закрыли но нам нужно что то взять из обьекта то в этом нам помогает геттер который
     *   возврощает значение а сеттер позволяет данное значение внести или изменить в обьекте котоырй был создан по
     *   шаблону класса в котором его параметры закрыты.
     *
     *   второе задание по 20 теме я помещу в папку TaskC и
     */


}
